xmlthing.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"	xmlns:v1="http://purolator.com/pws/datatypes/v1">  <soapenv:Header>       <v1:RequestContext>    <v1:Version>1.2</v1:Version>    <v1:Language>en</v1:Language>         <v1:GroupID>SOMETHING</v1:GroupID>    <v1:RequestReference>RequestReference</v1:RequestReference>       </v1:RequestContext></soapenv:Header>  <soapenv:Body>    <v1:SchedulePickUpRequest>           <v1:BillingAccountNumber>7079989</v1:BillingAccountNumber>      <v1:PickupInstruction>             <v1:Date>2019-06-23</v1:Date>        <v1:AnyTimeAfter>08:24:54</v1:AnyTimeAfter>             <v1:UntilTime>17:24:54</v1:UntilTime>        <v1:TotalWeight>          <v1:Value>2</v1:Value>               <v1:WeightUnit>lb</v1:WeightUnit>        </v1:TotalWeight>        <v1:TotalPieces>1</v1:TotalPieces>             <v1:PickUpLocation>Receiving</v1:PickUpLocation>        <v1:AdditionalInstructions>get      it</v1:AdditionalInstructions>      </v1:PickupInstruction>      <v1:Address>       <v1:Name>Guy</v1:Name>  <v1:Company></v1:Company>  <v1:Department></v1:Department>       <v1:StreetNumber></v1:StreetNumber>  <v1:StreetName>1494 Comfrey Crescent</v1:StreetName>       <v1:StreetAddress2></v1:StreetAddress2>  <v1:City>ORLEANS</v1:City>  <v1:Province>ON</v1:Province>       <v1:Country>CA</v1:Country>  <v1:PostalCode>K4A0T1</v1:PostalCode>  <v1:PhoneNumber>         <v1:CountryCode>1</v1:CountryCode>    <v1:AreaCode>347</v1:AreaCode>         <v1:Phone>6882541</v1:Phone>    <v1:Extension></v1:Extension>  </v1:PhoneNumber></v1:Address>         </v1:SchedulePickUpRequest>  </soapenv:Body></soapenv:Envelope>